---
title: OptionalFunctionalityUtils
classe: Autodesk.Revit.DB.OptionalFunctionalityUtils
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 19
---

# OptionalFunctionalityUtils

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean Is3DMImportLinkAvailable()` | `OptionalFunctionalityUtils.Is3DMImportLinkAvailable()` | Boolean |
| `Boolean IsAXMImportLinkAvailable()` | `OptionalFunctionalityUtils.IsAXMImportLinkAvailable()` | Boolean |
| `Boolean IsDGNExportAvailable()` | `OptionalFunctionalityUtils.IsDGNExportAvailable()` | Boolean |
| `Boolean IsDGNImportLinkAvailable()` | `OptionalFunctionalityUtils.IsDGNImportLinkAvailable()` | Boolean |
| `Boolean IsDWFExportAvailable()` | `OptionalFunctionalityUtils.IsDWFExportAvailable()` | Boolean |
| `Boolean IsDWGExportAvailable()` | `OptionalFunctionalityUtils.IsDWGExportAvailable()` | Boolean |
| `Boolean IsDWGImportLinkAvailable()` | `OptionalFunctionalityUtils.IsDWGImportLinkAvailable()` | Boolean |
| `Boolean IsDXFExportAvailable()` | `OptionalFunctionalityUtils.IsDXFExportAvailable()` | Boolean |
| `Boolean IsFBXExportAvailable()` | `OptionalFunctionalityUtils.IsFBXExportAvailable()` | Boolean |
| `Boolean IsGraphicsAvailable()` | `OptionalFunctionalityUtils.IsGraphicsAvailable()` | Boolean |
| `Boolean IsIFCAvailable()` | `OptionalFunctionalityUtils.IsIFCAvailable()` | Boolean |
| `Boolean IsNavisworksExporterAvailable()` | `OptionalFunctionalityUtils.IsNavisworksExporterAvailable()` | Boolean |
| `Boolean IsOBJImportLinkAvailable()` | `OptionalFunctionalityUtils.IsOBJImportLinkAvailable()` | Boolean |
| `Boolean IsPDFImportAvailable()` | `OptionalFunctionalityUtils.IsPDFImportAvailable()` | Boolean |
| `Boolean IsSATImportLinkAvailable()` | `OptionalFunctionalityUtils.IsSATImportLinkAvailable()` | Boolean |
| `Boolean IsShapeImporterAvailable()` | `OptionalFunctionalityUtils.IsShapeImporterAvailable()` | Boolean |
| `Boolean IsSKPImportLinkAvailable()` | `OptionalFunctionalityUtils.IsSKPImportLinkAvailable()` | Boolean |
| `Boolean IsSTEPImportLinkAvailable()` | `OptionalFunctionalityUtils.IsSTEPImportLinkAvailable()` | Boolean |
| `Boolean IsSTLImportLinkAvailable()` | `OptionalFunctionalityUtils.IsSTLImportLinkAvailable()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```